Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
<?xml version="1.0"?>
<!-- ============================================================================ -->
<!--                Microchip Microcontroller Software Support                    -->
<!--                       SAM Software Package License                           -->
<!-- ============================================================================ -->
<!-- Copyright (c) %copyright_year%, Microchip Technology Inc.                    -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Microchip's name may not be used to endorse or promote products derived from -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS  -->
<!-- OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES -->
<!-- OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT    -->
<!-- ARE DISCLAIMED. IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT,        -->
<!-- INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           -->
<!-- (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; -->
<!-- LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND  -->
<!-- ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   -->
<!-- (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF     -->
<!-- THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.            -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2019-01-23T22:42:06Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="ATSAMA5D23C-CU" package="TFBGA196" pinout="TFBGA196" speedmax="+0" tempmax="+85" tempmin="-40" vccmax="+0" vccmin="+0" mhc:ordercode="ATSAMA5D23C-CU"/>
    <variant ordercode="ATSAMA5D23C-CUR" package="TFBGA196" pinout="TFBGA196" speedmax="+0" tempmax="+85" tempmin="-40" vccmax="+0" vccmin="+0" mhc:ordercode="ATSAMA5D23C-CU"/>
    <variant ordercode="ATSAMA5D23C-CN" package="TFBGA196" pinout="TFBGA196" speedmax="+0" tempmax="+105" tempmin="-40" vccmax="+0" vccmin="+0" mhc:ordercode="ATSAMA5D23C-CN"/>
    <variant ordercode="ATSAMA5D23C-CNR" package="TFBGA196" pinout="TFBGA196" speedmax="+0" tempmax="+105" tempmin="-40" vccmax="+0" vccmin="+0" mhc:ordercode="ATSAMA5D23C-CNR"/>
  </variants>
  <devices>
    <device architecture="CORTEX-A5" family="SAMA5D2" name="ATSAMA5D23" series="SAMA5D2">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="EBI_CS0" start="0x10000000" size="0x10000000" type="other"/>
          <memory-segment name="DDR_CS" start="0x20000000" size="0x20000000" type="other"/>
          <memory-segment name="DDR_AES_CS" start="0x40000000" size="0x20000000" type="other"/>
          <memory-segment name="EBI_CS1" start="0x60000000" size="0x10000000" type="other"/>
          <memory-segment name="EBI_CS2" start="0x70000000" size="0x10000000" type="other"/>
          <memory-segment name="EBI_CS3" start="0x80000000" size="0x08000000" type="other"/>
          <memory-segment name="QSPI_AES0" start="0x90000000" size="0x08000000" type="other"/>
          <memory-segment name="QSPI_AES1" start="0x98000000" size="0x08000000" type="other"/>
          <memory-segment name="SDMMC1" start="0xB0000000" size="0x00001000" type="other"/>
          <memory-segment name="NFC" start="0xC0000000" size="0x10000000" type="other"/>
          <memory-segment name="QSPI0MEM" start="0xD0000000" size="0x08000000" type="other"/>
          <memory-segment name="QSPI1MEM" start="0xD8000000" size="0x08000000" type="other"/>
          <memory-segment name="PERIPHERALS" start="0xF0000000" size="0x10000000" type="io" rw="RW"/>
          <memory-segment name="IROM" start="0x00000000" size="0x00010000" type="rom"/>
          <memory-segment name="ECC_ROM" start="0x00040000" size="0x00018000" type="other"/>
          <memory-segment name="NFC_RAM" start="0x00100000" size="0x00002400" type="other"/>
          <memory-segment name="SRAM0" start="0x00200000" size="0x00020000" type="other"/>
          <memory-segment name="SRAM1" start="0x00220000" size="0x00020000" type="other"/>
          <memory-segment name="UDPHS_RAM" start="0x00300000" size="0x00100000" type="other"/>
          <memory-segment name="UHPHS_OHCI" start="0x00400000" size="0x00100000" type="other"/>
          <memory-segment name="UHPHS_EHCI" start="0x00500000" size="0x00100000" type="other"/>
          <memory-segment name="AXIMX" start="0x00600000" size="0x00100000" type="other"/>
          <memory-segment name="DAP" start="0x00700000" size="0x00100000" type="other"/>
          <memory-segment name="PTCMEM" start="0x00800000" size="0x00100000" type="other"/>
          <memory-segment name="SECURAM" start="0xF8044000" size="0x00004000" type="other"/>
        </address-space>
      </address-spaces>
      <parameters>
        <param name="__CA_REV" value="0x0001" caption="CA5 Core Revision"/>
        <param name="__FPU_PRESENT" value="1" caption="FPU is present on core"/>
        <param name="__GIC_PRESENT" value="0" caption="GIC is present on core"/>
        <param name="__TIM_PRESENT" value="0" caption="Private Timer is present on core"/>
        <param name="__L2CC_PRESENT" value="1" caption="L2C-310 cache controller is present"/>
      </parameters>
      <peripherals>
        <module name="ACC" id="6490" version="M">
          <instance name="ACC">
            <register-group address-space="base" name="ACC" name-in-module="ACC" offset="0xF804A000"/>
            <parameters>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="44073" version="G">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0xFC030000"/>
            <parameters>
              <param name="INSTANCE_ID" value="40"/>
              <param name="CLOCK_ID" value="40"/>
              <param name="DMAC_ID_RX" value="25"/>
            </parameters>
            <signals>
              <signal pad="PD31" function="A" group="ADTRG"/>
              <signal pad="PD19" function="X1" group="AD" index="0"/>
              <signal pad="PD20" function="X1" group="AD" index="1"/>
              <signal pad="PD21" function="X1" group="AD" index="2"/>
              <signal pad="PD22" function="X1" group="AD" index="3"/>
              <signal pad="PD23" function="X1" group="AD" index="4"/>
              <signal pad="PD24" function="X1" group="AD" index="5"/>
              <signal pad="PD25" function="X1" group="AD" index="6"/>
              <signal pad="PD26" function="X1" group="AD" index="7"/>
              <signal pad="PD27" function="X1" group="AD" index="8"/>
              <signal pad="PD28" function="X1" group="AD" index="9"/>
              <signal pad="PD29" function="X1" group="AD" index="10"/>
              <signal pad="PD30" function="X1" group="AD" index="11"/>
            </signals>
          </instance>
        </module>
        <module name="AES" id="6149" version="ZB">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0xF002C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="9"/>
              <param name="CLOCK_ID" value="9"/>
              <param name="DMAC_ID_TX" value="26"/>
              <param name="DMAC_ID_RX" value="27"/>
            </parameters>
          </instance>
        </module>
        <module name="AESB" id="11145" version="E">
          <instance name="AESB">
            <register-group address-space="base" name="AESB" name-in-module="AESB" offset="0xF001C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="10"/>
              <param name="CLOCK_ID" value="10"/>
            </parameters>
          </instance>
        </module>
        <module name="AIC" id="11051" version="K">
          <instance name="AIC">
            <register-group address-space="base" name="AIC" name-in-module="AIC" offset="0xFC020000"/>
            <parameters>
              <param name="INSTANCE_ID" value="62"/>
              <param name="ID_AIC_IRQ" value="49"/>
            </parameters>
            <signals>
              <signal pad="PA12" function="B" group="IRQ"/>
              <signal pad="PA21" function="A" group="IRQ"/>
              <signal pad="PB3" function="C" group="IRQ"/>
              <signal pad="PD31" function="C" group="IRQ"/>
            </signals>
          </instance>
          <instance name="SAIC">
            <register-group address-space="base" name="SAIC" name-in-module="AIC" offset="0xF803C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="61"/>
              <param name="ID_SAIC_FIQ" value="0"/>
            </parameters>
            <signals>
              <signal pad="PB4" function="C" group="FIQ"/>
              <signal pad="PC8" function="C" group="FIQ"/>
              <signal pad="PC9" function="A" group="FIQ"/>
              <signal pad="PD3" function="B" group="FIQ"/>
            </signals>
          </instance>
        </module>
        <module name="AXIMX" id="11103" version="E">
          <instance name="AXIMX">
            <register-group address-space="base" name="AXIMX" name-in-module="AXIMX" offset="0x00600000"/>
