Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
        <register caption="Interrupt Mask Register" name="ISC_INTMASK" offset="0x30" rw="R" size="4">
          <bitfield caption="Vertical Synchronization Detection Interrupt Mask" mask="0x00000001" name="VD"/>
          <bitfield caption="Horizontal Synchronization Detection Interrupt Mask" mask="0x00000002" name="HD"/>
          <bitfield caption="Software Reset Completed Interrupt Mask" mask="0x00000010" name="SWRST"/>
          <bitfield caption="Disable Completed Interrupt Mask" mask="0x00000020" name="DIS"/>
          <bitfield caption="DMA Done Interrupt Mask" mask="0x00000100" name="DDONE"/>
          <bitfield caption="DMA List Done Interrupt Mask" mask="0x00000200" name="LDONE"/>
          <bitfield caption="Histogram Completed Interrupt Mask" mask="0x00001000" name="HISDONE"/>
          <bitfield caption="Histogram Clear Interrupt Mask" mask="0x00002000" name="HISCLR"/>
          <bitfield caption="Write Channel Error Interrupt Mask" mask="0x00010000" name="WERR"/>
          <bitfield caption="Read Channel Error Interrupt Mask" mask="0x00100000" name="RERR"/>
          <bitfield caption="Vertical Front Porch Overflow Interrupt Mask" mask="0x01000000" name="VFPOV"/>
          <bitfield caption="Data Overflow Interrupt Mask" mask="0x02000000" name="DAOV"/>
          <bitfield caption="Vertical Synchronization Timeout Interrupt Mask" mask="0x04000000" name="VDTO"/>
          <bitfield caption="Horizontal Synchronization Timeout Interrupt Mask" mask="0x08000000" name="HDTO"/>
          <bitfield caption="CCIR Decoder Error Interrupt Mask" mask="0x10000000" name="CCIRERR"/>
        </register>
        <register caption="Interrupt Status Register" name="ISC_INTSR" offset="0x34" rw="R" size="4">
          <bitfield caption="Vertical Synchronization Detected Interrupt" mask="0x00000001" name="VD"/>
          <bitfield caption="Horizontal Synchronization Detected Interrupt" mask="0x00000002" name="HD"/>
          <bitfield caption="Software Reset Completed Interrupt" mask="0x00000010" name="SWRST"/>
          <bitfield caption="Disable Completed Interrupt" mask="0x00000020" name="DIS"/>
          <bitfield caption="DMA Done Interrupt" mask="0x00000100" name="DDONE"/>
          <bitfield caption="DMA List Done Interrupt" mask="0x00000200" name="LDONE"/>
          <bitfield caption="Histogram Completed Interrupt" mask="0x00001000" name="HISDONE"/>
          <bitfield caption="Histogram Clear Interrupt" mask="0x00002000" name="HISCLR"/>
          <bitfield caption="Write Channel Error Interrupt" mask="0x00010000" name="WERR"/>
          <bitfield caption="Write Channel Error Identifier" mask="0x00060000" name="WERRID" values="ISC_INTSR__WERRID"/>
          <bitfield caption="Read Channel Error Interrupt" mask="0x00100000" name="RERR"/>
          <bitfield caption="Vertical Front Porch Overflow Interrupt" mask="0x01000000" name="VFPOV"/>
          <bitfield caption="Data Overflow Interrupt" mask="0x02000000" name="DAOV"/>
          <bitfield caption="Vertical Synchronization Timeout Interrupt" mask="0x04000000" name="VDTO"/>
          <bitfield caption="Horizontal Synchronization Timeout Interrupt" mask="0x08000000" name="HDTO"/>
          <bitfield caption="CCIR Decoder Error Interrupt" mask="0x10000000" name="CCIRERR"/>
        </register>
        <register caption="White Balance Control Register" name="ISC_WB_CTRL" offset="0x58" rw="RW" size="4">
          <bitfield caption="White Balance Enable" mask="0x00000001" name="ENABLE"/>
        </register>
        <register caption="White Balance Configuration Register" name="ISC_WB_CFG" offset="0x5C" rw="RW" size="4">
          <bitfield caption="White Balance Bayer Configuration (Pixel Color Pattern)" mask="0x00000003" name="BAYCFG" values="ISC_WB_CFG__BAYCFG"/>
        </register>
        <register caption="White Balance Offset for R, GR Register" name="ISC_WB_O_RGR" offset="0x60" rw="RW" size="4">
          <bitfield caption="Offset Red Component (signed 13 bits 1:12:0)" mask="0x00001FFF" name="ROFST"/>
          <bitfield caption="Offset Green Component for Red Row (signed 13 bits 1:12:0)" mask="0x1FFF0000" name="GROFST"/>
        </register>
        <register caption="White Balance Offset for B, GB Register" name="ISC_WB_O_BGB" offset="0x64" rw="RW" size="4">
          <bitfield caption="Offset Blue Component (signed 13 bits, 1:12:0)" mask="0x00001FFF" name="BOFST"/>
          <bitfield caption="Offset Green Component for Blue Row (signed 13 bits, 1:12:0)" mask="0x1FFF0000" name="GBOFST"/>
        </register>
        <register caption="White Balance Gain for R, GR Register" name="ISC_WB_G_RGR" offset="0x68" rw="RW" size="4">
          <bitfield caption="Red Component Gain (unsigned 13 bits, 0:4:9)" mask="0x00001FFF" name="RGAIN"/>
          <bitfield caption="Green Component (Red row) Gain (unsigned 13 bits, 0:4:9)" mask="0x1FFF0000" name="GRGAIN"/>
        </register>
        <register caption="White Balance Gain for B, GB Register" name="ISC_WB_G_BGB" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Blue Component Gain (unsigned 13 bits, 0:4:9)" mask="0x00001FFF" name="BGAIN"/>
          <bitfield caption="Green Component (Blue row) Gain (unsigned 13 bits, 0:4:9)" mask="0x1FFF0000" name="GBGAIN"/>
        </register>
        <register caption="Color Filter Array Control Register" name="ISC_CFA_CTRL" offset="0x70" rw="RW" size="4">
          <bitfield caption="Color Filter Array Interpolation Enable" mask="0x00000001" name="ENABLE"/>
        </register>
        <register caption="Color Filter Array Configuration Register" name="ISC_CFA_CFG" offset="0x74" rw="RW" size="4">
          <bitfield caption="Color Filter Array Pattern" mask="0x00000003" name="BAYCFG" values="ISC_CFA_CFG__BAYCFG"/>
          <bitfield caption="Edge Interpolation" mask="0x00000010" name="EITPOL"/>
        </register>
        <register caption="Color Correction Control Register" name="ISC_CC_CTRL" offset="0x78" rw="RW" size="4">
          <bitfield caption="Color Correction Enable" mask="0x00000001" name="ENABLE"/>
        </register>
        <register caption="Color Correction RR RG Register" name="ISC_CC_RR_RG" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Red Gain for Red Component (signed 12 bits, 1:3:8)" mask="0x00000FFF" name="RRGAIN"/>
          <bitfield caption="Green Gain for Red Component (signed 12 bits, 1:3:8)" mask="0x0FFF0000" name="RGGAIN"/>
        </register>
