Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
        <register caption="LCD Controller Interrupt Status Register" name="LCDC_LCDISR" offset="0x00000038" rw="R" size="4">
          <bitfield caption="Start of Frame Interrupt Status" mask="0x00000001" name="SOF"/>
          <bitfield caption="LCD Disable Interrupt Status" mask="0x00000002" name="DIS"/>
          <bitfield caption="Powerup/Powerdown Sequence Terminated Interrupt Status" mask="0x00000004" name="DISP"/>
          <bitfield caption="Output FIFO Error" mask="0x00000010" name="FIFOERR"/>
          <bitfield caption="Base Layer Raw Interrupt Status" mask="0x00000100" name="BASE"/>
          <bitfield caption="Overlay 1 Raw Interrupt Status" mask="0x00000200" name="OVR1"/>
          <bitfield caption="Overlay 2 Raw Interrupt Status" mask="0x00000400" name="OVR2"/>
          <bitfield caption="High-End Overlay Raw Interrupt Status" mask="0x00000800" name="HEO"/>
          <bitfield caption="Post Processing Raw Interrupt Status" mask="0x00002000" name="PP"/>
        </register>
        <register caption="LCD Controller Attribute Register" name="LCDC_ATTR" offset="0x0000003C" rw="W" size="4">
          <bitfield caption="Base Layer Update Attribute" mask="0x00000001" name="BASE"/>
          <bitfield caption="Overlay 1 Update Attribute" mask="0x00000002" name="OVR1"/>
          <bitfield caption="Overlay 2 Update Attribute" mask="0x00000004" name="OVR2"/>
          <bitfield caption="High-End Overlay Update Attribute" mask="0x00000008" name="HEO"/>
          <bitfield caption="Post-Processing Update Attribute" mask="0x00000020" name="PP"/>
          <bitfield caption="Base Layer Update Add To Queue" mask="0x00000100" name="BASEA2Q"/>
          <bitfield caption="Overlay 1 Update Add To Queue" mask="0x00000200" name="OVR1A2Q"/>
          <bitfield caption="Overlay 2 Update Add to Queue" mask="0x00000400" name="OVR2A2Q"/>
          <bitfield caption="High-End Overlay Update Add To Queue" mask="0x00000800" name="HEOA2Q"/>
          <bitfield caption="Post-Processing Update Add To Queue" mask="0x00002000" name="PPA2Q"/>
        </register>
        <register caption="Base Layer Channel Enable Register" name="LCDC_BASECHER" offset="0x00000040" rw="W" size="4">
          <bitfield caption="Channel Enable" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add To Queue Enable" mask="0x00000004" name="A2QEN"/>
        </register>
        <register caption="Base Layer Channel Disable Register" name="LCDC_BASECHDR" offset="0x00000044" rw="W" size="4">
          <bitfield caption="Channel Disable" mask="0x00000001" name="CHDIS"/>
          <bitfield caption="Channel Reset" mask="0x00000100" name="CHRST"/>
        </register>
        <register caption="Base Layer Channel Status Register" name="LCDC_BASECHSR" offset="0x00000048" rw="R" size="4">
          <bitfield caption="Channel Status" mask="0x00000001" name="CHSR"/>
          <bitfield caption="Update Overlay Attributes In Progress Status" mask="0x00000002" name="UPDATESR"/>
          <bitfield caption="Add To Queue Status" mask="0x00000004" name="A2QSR"/>
        </register>
        <register caption="Base Layer Interrupt Enable Register" name="LCDC_BASEIER" offset="0x0000004C" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Enable" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Base Layer Interrupt Disabled Register" name="LCDC_BASEIDR" offset="0x00000050" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Disable" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Disable" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Disable" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Disable" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Base Layer Interrupt Mask Register" name="LCDC_BASEIMR" offset="0x00000054" rw="R" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Mask" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Mask" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Mask" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Mask" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Mask" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Base Layer Interrupt Status Register" name="LCDC_BASEISR" offset="0x00000058" rw="R" size="4">
          <bitfield caption="End of DMA Transfer" mask="0x00000004" name="DMA"/>
          <bitfield caption="DMA Descriptor Loaded" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Detected" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Detected" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Base DMA Head Register" name="LCDC_BASEHEAD" offset="0x0000005C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFC" name="HEAD"/>
        </register>
        <register caption="Base DMA Address Register" name="LCDC_BASEADDR" offset="0x00000060" rw="RW" size="4">
          <bitfield caption="DMA Transfer Start Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Base DMA Control Register" name="LCDC_BASECTRL" offset="0x00000064" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="DFETCH"/>
          <bitfield caption="Lookup Table Fetch Enable" mask="0x00000002" name="LFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="ADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONEIEN"/>
        </register>
        <register caption="Base DMA Next Register" name="LCDC_BASENEXT" offset="0x00000068" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="NEXT"/>
        </register>
        <register caption="Base Layer Configuration Register 0" name="LCDC_BASECFG0" offset="0x0000006C" rw="RW" size="4">
          <bitfield caption="Source Interface" mask="0x00000001" name="SIF"/>
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN" values="LCDC_BASECFG0__BLEN"/>
          <bitfield caption="Defined Length Burst Only For Channel Bus Transaction" mask="0x00000100" name="DLBO"/>
        </register>
        <register caption="Base Layer Configuration Register 1" name="LCDC_BASECFG1" offset="0x00000070" rw="RW" size="4">
          <bitfield caption="Color Lookup Table Mode Enable" mask="0x00000001" name="CLUTEN"/>
          <bitfield caption="RGB Mode Input Selection" mask="0x000000F0" name="RGBMODE" values="LCDC_BASECFG1__RGBMODE"/>
          <bitfield caption="Color Lookup Table Mode Input Selection" mask="0x00000300" name="CLUTMODE" values="LCDC_BASECFG1__CLUTMODE"/>
        </register>
        <register caption="Base Layer Configuration Register 2" name="LCDC_BASECFG2" offset="0x00000074" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="Base Layer Configuration Register 3" name="LCDC_BASECFG3" offset="0x00000078" rw="RW" size="4">
          <bitfield caption="Blue Default" mask="0x000000FF" name="BDEF"/>
          <bitfield caption="Green Default" mask="0x0000FF00" name="GDEF"/>
          <bitfield caption="Red Default" mask="0x00FF0000" name="RDEF"/>
        </register>
        <register caption="Base Layer Configuration Register 4" name="LCDC_BASECFG4" offset="0x0000007C" rw="RW" size="4">
          <bitfield caption="Use DMA Data Path" mask="0x00000100" name="DMA"/>
          <bitfield caption="Use Replication logic to expand RGB color to 24 bits" mask="0x00000200" name="REP"/>
          <bitfield caption="Discard Area Enable" mask="0x00000800" name="DISCEN"/>
        </register>
        <register caption="Base Layer Configuration Register 5" name="LCDC_BASECFG5" offset="0x00000080" rw="RW" size="4">
          <bitfield caption="Discard Area Horizontal Coordinate" mask="0x000007FF" name="DISCXPOS"/>
          <bitfield caption="Discard Area Vertical Coordinate" mask="0x07FF0000" name="DISCYPOS"/>
        </register>
        <register caption="Base Layer Configuration Register 6" name="LCDC_BASECFG6" offset="0x00000084" rw="RW" size="4">
          <bitfield caption="Discard Area Horizontal Size" mask="0x000007FF" name="DISCXSIZE"/>
          <bitfield caption="Discard Area Vertical Size" mask="0x07FF0000" name="DISCYSIZE"/>
        </register>
        <register caption="Overlay 1 Channel Enable Register" name="LCDC_OVR1CHER" offset="0x00000140" rw="W" size="4">
          <bitfield caption="Channel Enable" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add To Queue Enable" mask="0x00000004" name="A2QEN"/>
        </register>
