Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
        <register caption="Master Error Status Register" name="MATRIX_MESR" offset="0x015C" rw="R" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
        </register>
        <register caption="Master 0 Error Address Register" count="12" name="MATRIX_MEAR" offset="0x0160" rw="R" size="4">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Write Protection Mode Register" name="MATRIX_WPMR" offset="0x01E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key (Write-only)" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Security Slave 0 Register" count="15" name="MATRIX_SSR" offset="0x0200" rw="RW" size="4">
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000001" name="LANSECH0"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000002" name="LANSECH1"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000004" name="LANSECH2"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000008" name="LANSECH3"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000010" name="LANSECH4"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000020" name="LANSECH5"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000040" name="LANSECH6"/>
          <bitfield caption="Low Area Non-secured in HSELx Security Region" mask="0x00000080" name="LANSECH7"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00000100" name="RDNSECH0"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00000200" name="RDNSECH1"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00000400" name="RDNSECH2"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00000800" name="RDNSECH3"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00001000" name="RDNSECH4"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00002000" name="RDNSECH5"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00004000" name="RDNSECH6"/>
          <bitfield caption="Read Non-secured for HSELx Security Region" mask="0x00008000" name="RDNSECH7"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00010000" name="WRNSECH0"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00020000" name="WRNSECH1"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00040000" name="WRNSECH2"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00080000" name="WRNSECH3"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00100000" name="WRNSECH4"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00200000" name="WRNSECH5"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00400000" name="WRNSECH6"/>
          <bitfield caption="Write Non-secured for HSELx Security Region" mask="0x00800000" name="WRNSECH7"/>
        </register>
        <register caption="Security Areas Split Slave 0 Register" count="15" name="MATRIX_SASSR" offset="0x0240" rw="RW" size="4">
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x0000000F" name="SASPLIT0"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x000000F0" name="SASPLIT1"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x00000F00" name="SASPLIT2"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x0000F000" name="SASPLIT3"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x000F0000" name="SASPLIT4"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x00F00000" name="SASPLIT5"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0x0F000000" name="SASPLIT6"/>
          <bitfield caption="Security Areas Split for HSELx Security Region" mask="0xF0000000" name="SASPLIT7"/>
        </register>
        <register caption="Security Region Top Slave 1 Register" count="14" name="MATRIX_SRTSR" offset="0x0284" rw="RW" size="4">
          <bitfield caption="HSELx Security Region Top" mask="0x0000000F" name="SRTOP0"/>
          <bitfield caption="HSELx Security Region Top" mask="0x000000F0" name="SRTOP1"/>
          <bitfield caption="HSELx Security Region Top" mask="0x00000F00" name="SRTOP2"/>
          <bitfield caption="HSELx Security Region Top" mask="0x0000F000" name="SRTOP3"/>
          <bitfield caption="HSELx Security Region Top" mask="0x000F0000" name="SRTOP4"/>
          <bitfield caption="HSELx Security Region Top" mask="0x00F00000" name="SRTOP5"/>
          <bitfield caption="HSELx Security Region Top" mask="0x0F000000" name="SRTOP6"/>
          <bitfield caption="HSELx Security Region Top" mask="0xF0000000" name="SRTOP7"/>
        </register>
