Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
      <value-group caption="Activity" name="MCAN_PSR__ACT">
        <value caption="Node is synchronizing on CAN communication" name="SYNCHRONIZING" value="0x0"/>
        <value caption="Node is neither receiver nor transmitter" name="IDLE" value="0x1"/>
        <value caption="Node is operating as receiver" name="RECEIVER" value="0x2"/>
        <value caption="Node is operating as transmitter" name="TRANSMITTER" value="0x3"/>
      </value-group>
      <value-group caption="Reject Remote Frames Extended" name="MCAN_GFC__RRFE">
        <value caption="Filter remote frames with 29-bit extended IDs." name="FILTER" value="0"/>
        <value caption="Reject all remote frames with 29-bit extended IDs." name="REJECT" value="1"/>
      </value-group>
      <value-group caption="Reject Remote Frames Standard" name="MCAN_GFC__RRFS">
        <value caption="Filter remote frames with 11-bit standard IDs." name="FILTER" value="0"/>
        <value caption="Reject all remote frames with 11-bit standard IDs." name="REJECT" value="1"/>
      </value-group>
      <value-group caption="Accept Non-matching Frames Extended" name="MCAN_GFC__ANFE">
        <value caption="Accept in Rx FIFO 0" name="RX_FIFO_0" value="0"/>
        <value caption="Accept in Rx FIFO 1" name="RX_FIFO_1" value="1"/>
      </value-group>
      <value-group caption="Accept Non-matching Frames Standard" name="MCAN_GFC__ANFS">
        <value caption="Accept in Rx FIFO 0" name="RX_FIFO_0" value="0"/>
        <value caption="Accept in Rx FIFO 1" name="RX_FIFO_1" value="1"/>
      </value-group>
      <value-group caption="Message Storage Indicator" name="MCAN_HPMS__MSI">
        <value caption="No FIFO selected." name="NO_FIFO_SEL" value="0x0"/>
        <value caption="FIFO message lost." name="LOST" value="0x1"/>
        <value caption="Message stored in FIFO 0." name="FIFO_0" value="0x2"/>
        <value caption="Message stored in FIFO 1." name="FIFO_1" value="0x3"/>
      </value-group>
      <value-group caption="Debug Message Status" name="MCAN_RXF1S__DMS">
        <value caption="Idle state, wait for reception of debug messages, DMA request is cleared." name="IDLE" value="0x0"/>
        <value caption="Debug message A received." name="MSG_A" value="0x1"/>
        <value caption="Debug messages A, B received." name="MSG_AB" value="0x2"/>
        <value caption="Debug messages A, B, C received, DMA request is set." name="MSG_ABC" value="0x3"/>
      </value-group>
      <value-group caption="Receive FIFO 0 Data Field Size" name="MCAN_RXESC__F0DS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="Receive FIFO 1 Data Field Size" name="MCAN_RXESC__F1DS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="Receive Buffer Data Field Size" name="MCAN_RXESC__RBDS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="Tx Buffer Data Field Size" name="MCAN_TXESC__TBDS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48- byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="Event Type" name="MCAN_TXEFE_1__ET">
        <value caption="Tx event" name="TXE" value="1"/>
        <value caption="Transmission in spite of cancellation" name="TXC" value="2"/>
      </value-group>
      <value-group caption="Standard Filter Element Configuration" name="MCAN_SIDFE_0__SFEC">
        <value caption="Disable filter element" name="DISABLE" value="0"/>
        <value caption="Store in Rx FIFO 0 if filter matches" name="STF0M" value="1"/>
        <value caption="Store in Rx FIFO 1 if filter matches" name="STF1M" value="2"/>
        <value caption="Reject ID if filter matches" name="REJECT" value="3"/>
        <value caption="Set priority if filter matches" name="PRIORITY" value="4"/>
        <value caption="Set priority and store in FIFO 0 if filter matches" name="PRIF0M" value="5"/>
        <value caption="Set priority and store in FIFO 1 if filter matches" name="PRIF1M" value="6"/>
        <value caption="Store into Rx Buffer" name="STRXBUF" value="7"/>
      </value-group>
      <value-group caption="Standard Filter Type" name="MCAN_SIDFE_0__SFT">
        <value caption="Range filter from SFID1 to SFID2" name="RANGE" value="0"/>
        <value caption="Dual ID filter for SF1ID or SF2ID" name="DUAL" value="1"/>
        <value caption="Classic filter" name="CLASSIC" value="2"/>
      </value-group>
      <value-group caption="Extended Filter Element Configuration" name="MCAN_XIDFE_0__EFEC">
        <value caption="Disable filter element" name="DISABLE" value="0"/>
        <value caption="Store in Rx FIFO 0 if filter matches" name="STF0M" value="1"/>
        <value caption="Store in Rx FIFO 1 if filter matches" name="STF1M" value="2"/>
        <value caption="Reject ID if filter matches" name="REJECT" value="3"/>
        <value caption="Set priority if filter matches" name="PRIORITY" value="4"/>
        <value caption="Set priority and store in FIFO 0 if filter matches" name="PRIF0M" value="5"/>
        <value caption="Set priority and store in FIFO 1 if filter matches" name="PRIF1M" value="6"/>
        <value caption="Store into Rx Buffer" name="STRXBUF" value="7"/>
      </value-group>
      <value-group caption="Extended Filter Type" name="MCAN_XIDFE_1__EFT">
        <value caption="Range filter from EFID1 to EFID2" name="RANGE" value="0"/>
        <value caption="Dual ID filter for EFID1 or EFID2" name="DUAL" value="1"/>
        <value caption="Classic filter" name="CLASSIC" value="2"/>
        <value caption="Range filter from EFID1 to EFID2 with no XIDAM mask" name="RANGE_NO_XIDAM" value="3"/>
      </value-group>
    </module>
    <module caption="AHB Multiport DDR-SDRAM Controller" id="11043" name="MPDDRC" version="ZA">
      <register-group name="MPDDRC">
        <register caption="Mode Register" name="MPDDRC_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="MPDDRC Command Mode" mask="0x00000007" name="MODE" values="MPDDRC_MR__MODE"/>
          <bitfield caption="Device Autoinitialization Status (read-only)" mask="0x00000010" name="DAI" values="MPDDRC_MR__DAI"/>
          <bitfield caption="Mode Register Select LPDDR2/LPDDR3" mask="0x0000FF00" name="MRS"/>
        </register>
