Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
        <register caption="PIO Interrupt Disable Register" name="PIO_IDR" offset="0x24" rw="W" size="4" atomic-op="clear:PIO_IMR">
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Interrupt Mask Register" name="PIO_IMR" offset="0x28" rw="R" size="4" atomic-op="read:PIO_IMR">
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Interrupt Status Register" name="PIO_ISR" offset="0x2C" rw="R" size="4" atomic-op="clear:PIO_ISR">
          <bitfield caption="Input Change Interrupt Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO I/O Freeze Configuration Register" name="PIO_IOFR" offset="0x3C" rw="W" size="4">
          <bitfield caption="Freeze Physical Configuration" mask="0x00000001" name="FPHY"/>
          <bitfield caption="Freeze Interrupt Configuration" mask="0x00000002" name="FINT"/>
          <bitfield caption="Freeze Key" mask="0xFFFFFF00" name="FRZKEY" values="PIO_IOFR0__FRZKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="PIO_MSKR0__MSK0">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
