Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
      <value-group caption="" name="PIO_MSKR0__MSK1">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK2">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK3">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK4">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK5">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK6">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK7">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK8">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK9">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK10">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK11">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK12">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK13">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK14">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK15">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_MSKR0__MSK16">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
