Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
      <value-group caption="" name="PIO_CFGR0__PUEN">
        <value caption="Pull-Up is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Up is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__PDEN">
        <value caption="Pull-Down is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Down is enabled for the selected I/O lines only if PUEN is 0(1)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__IFEN">
        <value caption="The input filter is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="The input filter is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__IFSCEN">
        <value caption="The glitch filter is able to filter glitches with a duration &lt; tmck/2 for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="The debouncing filter is able to filter pulses with a duration &lt; tdiv_slck/2 for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__OPD">
        <value caption="The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level." name="DISABLED" value="0"/>
        <value caption="The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__SCHMITT">
        <value caption="Schmitt trigger is enabled for the selected I/O lines." name="ENABLED" value="0"/>
        <value caption="Schmitt trigger is disabled for the selected I/O lines." name="DISABLED" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__DRVSTR">
        <value caption="Low drive" name="LO" value="1"/>
        <value caption="Medium drive" name="ME" value="2"/>
        <value caption="High drive" name="HI" value="3"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__EVTSEL">
        <value caption="Event detection on input falling edge" name="FALLING" value="0x0"/>
        <value caption="Event detection on input rising edge" name="RISING" value="0x1"/>
        <value caption="Event detection on input both edge" name="BOTH" value="0x2"/>
        <value caption="Event detection on low level input" name="LOW" value="0x3"/>
        <value caption="Event detection on high level input" name="HIGH" value="0x4"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__PCFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_CFGR0__ICFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_IOFR0__FRZKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit." name="PASSWD" value="0x494F46"/>
      </value-group>
    </module>
    <module name="PIO_CTRL" caption="Parallel Input/Output Controller Control" id="11264" version="K">
      <register-group name="PIO_CTRL">
        <register caption="PIO Write Protection Mode Register" name="PIO_CTRL_WPMR" offset="0x0E0" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PIO_CTRL_WPMR__WPKEY"/>
        </register>
        <register caption="PIO Write Protection Status Register" name="PIO_CTRL_WPSR" offset="0x0E4" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="PIO_CTRL_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
    </module>
    <module caption="Periodic Interval Timer" id="6079" name="PIT" version="C">
      <register-group name="PIT">
        <register caption="Mode Register" name="PIT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Periodic Interval Value" mask="0x000FFFFF" name="PIV"/>
          <bitfield caption="Period Interval Timer Enabled" mask="0x01000000" name="PITEN"/>
          <bitfield caption="Periodic Interval Timer Interrupt Enable" mask="0x02000000" name="PITIEN"/>
        </register>
        <register caption="Status Register" name="PIT_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="Periodic Interval Timer Status" mask="0x00000001" name="PITS"/>
        </register>
        <register caption="Periodic Interval Value Register" name="PIT_PIVR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Periodic Interval Value" mask="0x000FFFFF" name="CPIV"/>
          <bitfield caption="Periodic Interval Counter" mask="0xFFF00000" name="PICNT"/>
        </register>
        <register caption="Periodic Interval Image Register" name="PIT_PIIR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Current Periodic Interval Value" mask="0x000FFFFF" name="CPIV"/>
          <bitfield caption="Periodic Interval Counter" mask="0xFFF00000" name="PICNT"/>
        </register>
      </register-group>
    </module>
    <module caption="Power Management Controller" id="11041" name="PMC" version="ZD">
      <register-group name="PMC">
        <register caption="System Clock Enable Register" name="PMC_SCER" offset="0x0000" rw="W" size="4">
          <bitfield caption="DDR Clock Enable" mask="0x00000004" name="DDRCK"/>
          <bitfield caption="MCK2x Clock Enable" mask="0x00000008" name="LCDCK"/>
          <bitfield caption="USB Host OHCI Clocks Enable" mask="0x00000040" name="UHP"/>
          <bitfield caption="USB Device Clock Enable" mask="0x00000080" name="UDP"/>
          <bitfield caption="Programmable Clock 0 Output Enable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Enable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Enable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="ISC Clock Enable" mask="0x00040000" name="ISCCK"/>
        </register>
        <register caption="System Clock Disable Register" name="PMC_SCDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="Processor Clock Disable" mask="0x00000001" name="PCK"/>
          <bitfield caption="DDR Clock Disable" mask="0x00000004" name="DDRCK"/>
          <bitfield caption="MCK2x Clock Disable" mask="0x00000008" name="LCDCK"/>
          <bitfield caption="USB Host OHCI Clock Disable" mask="0x00000040" name="UHP"/>
          <bitfield caption="USB Device Clock Enable" mask="0x00000080" name="UDP"/>
          <bitfield caption="Programmable Clock 0 Output Disable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Disable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Disable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="ISC Clock Disable" mask="0x00040000" name="ISCCK"/>
        </register>
