Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/0.1.6/atdf/ATSAMA5D23.atdf
      <value-group caption="Physical Interface Clock Ratio" name="QSPI_MR__PHYCR">
        <value caption="The physical interface clock is at the same speed as the QSPI controller clock." name="RATIO_1_1" value="0"/>
        <value caption="The physical interface clock is twice as fast as the QSPI controller clock." name="RATIO_1_2" value="1"/>
      </value-group>
      <value-group caption="Width of Instruction Code, Address, Option Code and Data" name="QSPI_IFR__WIDTH">
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI" name="SINGLE_BIT_SPI" value="0x0"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI" name="DUAL_OUTPUT" value="0x1"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI" name="QUAD_OUTPUT" value="0x2"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI" name="DUAL_IO" value="0x3"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI" name="QUAD_IO" value="0x4"/>
        <value caption="Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI" name="DUAL_CMD" value="0x5"/>
        <value caption="Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI" name="QUAD_CMD" value="0x6"/>
      </value-group>
      <value-group caption="Option Code Length" name="QSPI_IFR__OPTL">
        <value caption="The option code is 1 bit long." name="OPTION_1BIT" value="0x0"/>
        <value caption="The option code is 2 bits long." name="OPTION_2BIT" value="0x1"/>
        <value caption="The option code is 4 bits long." name="OPTION_4BIT" value="0x2"/>
        <value caption="The option code is 8 bits long." name="OPTION_8BIT" value="0x3"/>
      </value-group>
      <value-group caption="Address Length" name="QSPI_IFR__ADDRL">
        <value caption="The address is 24 bits long." name="_24_BIT" value="0"/>
        <value caption="The address is 32 bits long." name="_32_BIT" value="1"/>
      </value-group>
      <value-group caption="Data Transfer Type" name="QSPI_IFR__TFRTYP">
        <value caption="Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial Flash memory is not possible." name="TRSFR_READ" value="0x0"/>
        <value caption="Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial Flash memory is possible." name="TRSFR_READ_MEMORY" value="0x1"/>
        <value caption="Write transfer into the serial memory.Scrambling is not performed." name="TRSFR_WRITE" value="0x2"/>
        <value caption="Write data transfer into the serial memory.If enabled, scrambling is performed." name="TRSFR_WRITE_MEMORY" value="0x3"/>
      </value-group>
      <value-group caption="Continuous Read Mode" name="QSPI_IFR__CRM">
        <value caption="Continuous Read mode is disabled." name="DISABLED" value="0"/>
        <value caption="Continuous Read mode is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Scrambling/Unscrambling Enable" name="QSPI_SMR__SCREN">
        <value caption="The scrambling/unscrambling is disabled." name="DISABLED" value="0"/>
        <value caption="The scrambling/unscrambling is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="QSPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x515350"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__CSMODE">
        <value caption="The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer." name="NOT_RELOADED" value="0x0"/>
        <value caption="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in QSPI_TDR.TD has been transferred." name="LASTXFER" value="0x1"/>
        <value caption="The chip select is deasserted systematically after each transfer." name="SYSTEMATICALLY" value="0x2"/>
      </value-group>
    </module>
    <module caption="Reset Controller" id="11265" name="RSTC" version="C">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_CR__KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP" values="RSTC_SR__RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_MR__KEY"/>
        </register>
      </register-group>
      <value-group caption="Write Access Password" name="RSTC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Reset Type" name="RSTC_SR__RSTTYP">
        <value caption="Both VDDCORE and VDDBU rising" name="GENERAL_RST" value="0x0"/>
        <value caption="VDDCORE rising" name="WKUP_RST" value="0x1"/>
        <value caption="Watchdog fault occurred" name="WDT_RST" value="0x2"/>
        <value caption="Processor reset required by the software" name="SOFT_RST" value="0x3"/>
        <value caption="NRST pin detected low" name="USER_RST" value="0x4"/>
      </value-group>
      <value-group caption="Write Access Password" name="RSTC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module caption="Real-time Clock" id="6056" name="RTC" version="ZE">
      <register-group name="RTC_TS" size="12">
        <register caption="TimeStamp Time Register 0" name="RTC_TSTR" offset="0x0" rw="R" size="4">
          <mode name="DEFAULT" qualifier="RTC_MR.UTC" value="0"/>
          <mode name="UTC_MODE" qualifier="RTC_MR.UTC" value="0"/>
          <bitfield caption="Seconds of the Tamper" mask="0x0000007F" modes="DEFAULT" name="SEC"/>
          <bitfield caption="Minutes of the Tamper" mask="0x00007F00" modes="DEFAULT" name="MIN"/>
          <bitfield caption="Hours of the Tamper" mask="0x003F0000" modes="DEFAULT" name="HOUR"/>
          <bitfield caption="AM/PM Indicator of the Tamper" mask="0x00400000" modes="DEFAULT" name="AMPM"/>
          <bitfield caption="Tamper Events Counter" mask="0x0F000000" modes="DEFAULT" name="TEVCNT"/>
          <bitfield caption="System Mode of the Tamper" mask="0x80000000" modes="DEFAULT" name="BACKUP"/>
          <bitfield caption="Tamper Events Counter (cleared by reading RTC_TSSR0)" mask="0x0F000000" modes="UTC_MODE" name="TEVCNT"/>
          <bitfield caption="System Mode of the Tamper (cleared by reading RTC_TSSR0)" mask="0x80000000" modes="UTC_MODE" name="BACKUP"/>
        </register>
